Учет_проектов/src/Documents/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Проект</name>
  <registerRecords>AccumulationRegister.РаботыПоПроектам</registerRecords>
  <attributes>
    <name>ПлощадьВнутриТепловогоКонтура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьТеррасИКрылец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРаботЗаМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроекта</name>
    <type>
      <types>EnumRef.СтатусыПроектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботыПоПроекту</name>
    <attributes>
      <name>НаименованиеРабот</name>
      <type>
        <types>CatalogRef.НаборыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦиклРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапРабот</name>
      <type>
        <types>CatalogRef.ЭтапыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Контрагент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_проектов/src/Documents/Проект/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПересчитатьОбщуюПлощадь()
	ПРоект = РеквизитФормыВЗначение("Объект");
	Проект.ПлощадьВсего = Проект.ПлощадьВнутриТепловогоКонтура + Проект.ПлощадьТеррасИКрылец;
	ЗначениеВРеквизитФормы(Проект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьВнутриТепловогоКонтураПриИзменении(Элемент)
	ПересчитатьОбщуюПлощадь();
	ПересчитатьСтоимостьРаботЗаМетрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьТеррасИКрылецПриИзменении(Элемент)
	ПересчитатьОбщуюПлощадь();
	ПересчитатьСтоимостьРаботЗаМетрНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РаботыПоПроектуОбъемПриИзменении(Элемент)
	ТекДанные = Элементы.РаботыПоПроекту.ТекущиеДанные;
	РаботаСДокументамиКлиент.ПересчитатьСтрокуВПроекте(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПоПроектуРасценкаПриИзменении(Элемент)
	ТекДанные = Элементы.РаботыПоПроекту.ТекущиеДанные;
	РаботаСДокументамиКлиент.ПересчитатьСтрокуВПроекте(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтоимостьРаботЗаМетрНаСервере()
	ДокПРоект = РеквизитФормыВЗначение("Объект");
	СтоимостьРабот = ДокПРоект.РаботыПоПроекту.Итог("СметнаяСтоимость");
	ДокПРоект.СтоимостьРаботЗаМетр = СтоимостьРабот/ДокПРоект.ПлощадьВсего;
	ЗначениеВРеквизитФормы(ДокПРоект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура РаботыПоПроектуПриИзменении(Элемент)
	ПересчитатьСтоимостьРаботЗаМетрНаСервере();
КонецПроцедуры
